public class Main {
    public static void main(String[] args){
      new Thread(new Counter()).start();
      new Thread(new Counter()).start();
      new Thread(new Counter()).start();

      // ก่อนที่จะใส่ thread.sleep มันจะส่งข้อความออกมาทันทีของแต่ละเธรดและตัวเลขจะไม่เรียงกันเพราะจะพยายามส่งออกมาให้ไวที่สุดจึงทำให้ไม่ตรงตามลำดับช่วงเวลาของแต่ละอัน
      // เธรดแต่ละตัวทำงานตามลำดับที่มีการหน่วงเวลาโดยข้อความจากแต่ละเธรดจะถูกส่งออกมาในช่วงเวลาที่สุ่มออกมาและไม่เกิดการขัดแย้งในการพิมพ์ระหว่างเธรด

      /* 
        Multithreading ใน Java ช่วยให้โปรแกรมสามารถทำงานหลายเธรดได้พร้อมกัน โดยแต่ละเธรดจะเป็นเส้นทางการทำงานที่แยกจากกัน ช่วยให้สามารถทำงานหลายๆ งานในเวลาเดียวกัน หรือทำงานขนานกันได้ 
        ซึ่งช่วยเพิ่มประสิทธิภาพและการตอบสนองของโปรแกรม Java มีคลาส Thread และอินเตอร์เฟส Runnable สำหรับสร้างและจัดการเธรดเมื่อโปรแกรมเริ่มเธรดหลายๆ ตัว JVM (Java Virtual Machine) 
        จะเป็นผู้จัดการการทำงานของเธรดต่างๆ โดย JVM จะเลือกช่วงเวลาในการทำงานให้กับแต่ละเธรด แต่การจัดลำดับการทำงานนี้จะขึ้นอยู่กับปัจจัยต่างๆ เช่น การโหลดของระบบ, ความพร้อมของ CPU และอัลกอริธึมการจัดการเธรดของระบบปฏิบัติการ 
        ซึ่งทำให้การทำงานของเธรดแต่ละตัวอาจจะไม่เหมือนกันในทุกๆ การรันของโปรแกรม
      */
      }
}

